'''
Основное различие между этими двумя методами состоит в том,
 что __new__ обрабатывает создание объекта,
   а __init__ обрабатывает его инициализацию.

__new__ вызывается автоматически при вызове имени класса (при создании экземпляра),
 тогда как __init__ вызывается каждый раз, когда экземпляр класса возвращается __new__

 


 Инициализация — это процесс подготовки программы к использованию.
   В Python это означает установку начальных значений для переменных,
     создание объектов и выполнение других необходимых действий.
'''